StudentWork/Labs/WebServiceAttacks/Java/resources/EmailQueryBase.xml

<?xml version="1.0" encoding="utf-8"?> 

<soapenv:Envelope xmlns:q0="http://webservice.security.training.morello.com" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <q0:getEmail>
      <q0:username>dan</q0:username>
    </q0:getEmail>
  </soapenv:Body>
</soapenv:Envelope>